'''
Як ви знаєте, раніше телефони були з кнопками, та й зараз вони є подекуди у вжитку. 
Тоді текстові повідомлення набиралися за допомогою цифрових кнопок. 
Як інженери телефонів створили набір тексту? 
Рішення було в тому, що одна кнопка була асоційована одночасно з декількома літерами, а вибір залежав від кількості натискань на кнопку. 
Одноразове натискання призводило до появи першої літери у відповідному цій кнопці списку, наступні натискання змінювали її на наступну.

Символи, що відповідають кнопкам на телефонах
 ___________________
|Кнопка | Символи   |
|1	    | . , ? ! : |
|2	    | A B C     |
|3	    | D E F     |
|4	    | G H I     |
|5	    | J K L     |
|6	    | M N O     |
|7	    | P Q R S   |
|8	    | T U V     |
|9	    | W X Y Z   |
|0	    | Пробіл    |
|_______|___________|
Напишіть функцію sequence_buttons, що показує послідовність кнопок, яку необхідно натиснути, щоб на екрані телефону з'явився текст, введений користувачем.

Створіть словник, який відповідає символам з кнопками, які потрібно натиснути.

Приклад: якщо функції sequence_buttons передати рядок "Hello, World!", функція повинна повернути "4433555555666110966677755531111".

Вимоги:

функція коректно обробляє малі та великі літери.
функція ігнорує символи, що не входять до зазначеного списку
'''


string = "Hi there!" # Aloha Hawaii!



def sequence_buttons(string):
    list_button = {"0":[" "],
    "1":[".", ",", "?", "!", ":"],
    "2":["A", "B", "C"],
    "3":["D", "E", "F"],
    "4":["G", "H", "I"],
    "5":["J", "K", "L"],
    "6":["M", "N", "O"],
    "7":["P", "Q", "R", "S"],
    "8":["T", "U", "V"],
    "9":["W", "X", "Y", "Z"]
    }
    new_string = ""

    for i in string:
        for keys, val in list_button.items():
            try:
                index = val.index(i.upper())
                new_string += str(keys)*(index + 1)
            except ValueError:
                continue
    return new_string



print(sequence_buttons(string))